const NOTIF = {
    dog: [
        {
            id: 'טיולים',
            title: 'זמן לצאת לטיול!',
            desc: 'התחשבו בגיל ובגודל כלבכם.',
            times:[
                {
                    time:'10:00',
                    title: 'טיול בוקר',
                    desc: 'טיול לטובת צרכים, מומלץ כחצי שעה אם אפשרי.חשוב לזכור, האוכל תמיד יבוא אחרי הטיול.'
                },
                {
                    time:'14:00',
                    title: 'טיול צהריים',
                    desc: 'מומלץ לשמור על סדר יום של הכלב שלנו כך יהיה הרבה יותר קל לנו להתנהל איתו.'
                },
                {
                    time:'20:00',
                    title: 'טיול ערב',
                    desc: 'חשוב להוציא את הכלב לפחות 3 פעמים ביום. לפחות אחד מהטיולים צריך להיות פריקת אנרגיה.'
                },
            ]
        },
        {
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'13:00',
                    title: 'תביא לו אוכל דחוף',
                    desc: 'וואלק הוא רעב חרבות תביא לו אוכל עכשיו או שהוא בולע אותך יא טמבל'
                },
            ]
        },
    ],
    cat: [
        {
            id: 'טיולים',
            title: 'זמן לצאת לטיול!',
            desc: 'התחשבו בגיל ובגודל כלבכם.',
            times:[
                {
                    time:'10:00',
                    title: 'טיול בוקר',
                    desc: 'טיול לטובת צרכים, מומלץ כחצי שעה אם אפשרי.חשוב לזכור, האוכל תמיד יבוא אחרי הטיול.'
                },
                {
                    time:'14:00',
                    title: 'טיול צהריים',
                    desc: 'מומלץ לשמור על סדר יום של הכלב שלנו כך יהיה הרבה יותר קל לנו להתנהל איתו.'
                },
                {
                    time:'20:00',
                    title: 'טיול ערב',
                    desc: 'חשוב להוציא את הכלב לפחות 3 פעמים ביום. לפחות אחד מהטיולים צריך להיות פריקת אנרגיה.'
                },
            ]
        },
        {
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'13:00',
                    title: 'תביא לו אוכל דחוף',
                    desc: 'וואלק הוא רעב חרבות תביא לו אוכל עכשיו או שהוא בולע אותך יא טמבל'
                },
            ]
        },
    ],
    rabbit: [
        {
            id: 'טיולים',
            title: 'זמן לצאת לטיול!',
            desc: 'התחשבו בגיל ובגודל כלבכם.',
            times:[
                {
                    time:'10:00',
                    title: 'טיול בוקר',
                    desc: 'טיול לטובת צרכים, מומלץ כחצי שעה אם אפשרי.חשוב לזכור, האוכל תמיד יבוא אחרי הטיול.'
                },
                {
                    time:'14:00',
                    title: 'טיול צהריים',
                    desc: 'מומלץ לשמור על סדר יום של הכלב שלנו כך יהיה הרבה יותר קל לנו להתנהל איתו.'
                },
                {
                    time:'20:00',
                    title: 'טיול ערב',
                    desc: 'חשוב להוציא את הכלב לפחות 3 פעמים ביום. לפחות אחד מהטיולים צריך להיות פריקת אנרגיה.'
                },
            ]
        },
        {
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'13:00',
                    title: 'תביא לו אוכל דחוף',
                    desc: 'וואלק הוא רעב חרבות תביא לו אוכל עכשיו או שהוא בולע אותך יא טמבל'
                },
            ]
        },
    ],
    fish: [
        {
            id: 'טיולים',
            title: 'זמן לצאת לטיול!',
            desc: 'התחשבו בגיל ובגודל כלבכם.',
            times:[
                {
                    time:'10:00',
                    title: 'טיול בוקר',
                    desc: 'טיול לטובת צרכים, מומלץ כחצי שעה אם אפשרי.חשוב לזכור, האוכל תמיד יבוא אחרי הטיול.'
                },
                {
                    time:'14:00',
                    title: 'טיול צהריים',
                    desc: 'מומלץ לשמור על סדר יום של הכלב שלנו כך יהיה הרבה יותר קל לנו להתנהל איתו.'
                },
                {
                    time:'20:00',
                    title: 'טיול ערב',
                    desc: 'חשוב להוציא את הכלב לפחות 3 פעמים ביום. לפחות אחד מהטיולים צריך להיות פריקת אנרגיה.'
                },
            ]
        },
        {
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'13:00',
                    title: 'תביא לו אוכל דחוף',
                    desc: 'וואלק הוא רעב חרבות תביא לו אוכל עכשיו או שהוא בולע אותך יא טמבל'
                },
            ]
        },
    ],
    bird: [
        {
            id: 'טיולים',
            title: 'זמן לצאת לטיול!',
            desc: 'התחשבו בגיל ובגודל כלבכם.',
            times:[
                {
                    time:'10:00',
                    title: 'טיול בוקר',
                    desc: 'טיול לטובת צרכים, מומלץ כחצי שעה אם אפשרי.חשוב לזכור, האוכל תמיד יבוא אחרי הטיול.'
                },
                {
                    time:'14:00',
                    title: 'טיול צהריים',
                    desc: 'מומלץ לשמור על סדר יום של הכלב שלנו כך יהיה הרבה יותר קל לנו להתנהל איתו.'
                },
                {
                    time:'20:00',
                    title: 'טיול ערב',
                    desc: 'חשוב להוציא את הכלב לפחות 3 פעמים ביום. לפחות אחד מהטיולים צריך להיות פריקת אנרגיה.'
                },
            ]
        },
        {
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'13:00',
                    title: 'תביא לו אוכל דחוף',
                    desc: 'וואלק הוא רעב חרבות תביא לו אוכל עכשיו או שהוא בולע אותך יא טמבל'
                },
            ]
        },
    ],
}

function getNotif(animalName){
    return NOTIF[animalName]
}

export const notifService = {
    getNotif
}