const NOTIF = { //טיולים/חטיפים/אוכל/כדור/טיפוח
    dog: [
        { // טיולים
            id: 'טיולים',
            title: 'זמן לצאת לטיול!',
            desc: 'התחשבו בגיל ובגודל כלבכם.',
            times:[
                {
                    time:'10:00',
                    title: 'טיול בוקר',
                    desc: 'טיול לטובת צרכים, מומלץ כחצי שעה אם אפשרי.חשוב לזכור, האוכל תמיד יבוא אחרי הטיול.'
                },
                {
                    time:'14:00',
                    title: 'טיול צהריים',
                    desc: 'מומלץ לשמור על סדר יום של הכלב שלנו כך יהיה הרבה יותר קל לנו להתנהל איתו.'
                },
                {
                    time:'20:00',
                    title: 'טיול ערב',
                    desc: 'חשוב להוציא את הכלב לפחות 3 פעמים ביום. לפחות אחד מהטיולים צריך להיות פריקת אנרגיה.'
                },
            ]
        },
        { // חטיפים
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'15:00',
                    title: 'חטיף יומי',
                    desc: 'תלוי בגודלו של הכלב ובגודלו של החטיף, מומלץ בממוצע לא לתת יותר מחטיף אחד ביום.'
                },
            ]
        },
        { //אוכל
            id: 'אוכל',
            title: 'הגיע שעת האוכל',
            desc: 'לפי משקל, גיל וסוג האוכל',
            times: [
                {
                    time: '10:30',
                    title: 'ארוחת בוקר',
                    desc: 'חלוקת המזון עוזרת לשמור על פעילות מעיים תקינה ומונעת בעיות התנהגות הקשורות בתזונה.'
                },
                {
                    time: '20:00',
                    title: 'ארוחת ערב',
                    desc: 'זכרו שאם כלבכם פעיל במיוחד, ככל הנראה יזדקק לכמויות מזון גדולות יותר ממה שכתוב על השק.'
                }
            ]
        },
        { // כדור
            id: 'כדור',
            title: 'צריך לקחת כדור',
            desc: 'על פי הוראות הוטרינר.',
            times: [
                {
                    time: '10:00',
                    title: 'לקיחת כדור',
                    desc: 'חשוב לפעול במדויק לפי ההמלצות ובמידה ואתם לא מצליחים לגרום לכלב לבלוע את הכדור נסו לדחוף לאוכל רטוב.'
                }
            ]
        },
        { // טיפוח
            id: 'טיפוח',
            title: 'זמן טיפוח',
            desc: 'קביעת תור אצל הספר.ית',
            times: [
                {
                    time: '10:00',
                    title: 'התור הבא',
                    desc: 'מומלץ לעלות את תדירות התספורות בקיץ כדי להקל על הכלב בתנאי מזג האוויר.'
                }
            ]
        }
    ],
    cat: [
        { // חטיפים
            id: 'חטיפים',
            title: 'זמן לחטיף רטוב :)',
            desc: 'לפי הכמויות המומלצות.',
            times:[
                {
                    time:'15:00',
                    title: 'חטיף יומי',
                    desc: 'חתול מטבעו ממעיט בשתייה ולכן יש להגדיל את צריכת הנוזלים שלו על ידי חטיף רטוב פעם ביום.'
                },
            ]
        },
        { // אוכל
            id: 'אוכל',
            title: 'מילוי קערת האוכל',
            desc: 'לפי משקל גיל וסוג האוכל',
            times: [
                {
                    time: '10:00',
                    title: 'מילוי הקערה',
                    desc: 'חתולים אוכלים כעשר-עשרים ארוחות קטנות ביום ולפיכך ההמלצה היא מתן מזון חופשי לחתול.'
                }
            ]
        },
        { // ניקוי ארגז החול
            id: 'ניקוי ארגז החול',
            title: 'ניקוי ארגז החול',
            desc: 'ניקוי יומי והחלפה שבועית',
            times: [
                {
                    time: '18:00',
                    title: 'ניקוי יומי',
                    desc: 'צואת חתולים עלולה להכיל חיידקים, לאחר הטיפול בארגז יש לשטוף ידיים עם מים וסבון.'
                }
            ]
        },
        { // כדור
            id: 'כדור',
            title: 'צריך לקחת כדור',
            desc: 'על פי הוראות הוטרינר.',
            times: [
                {
                    time: '10:00',
                    title: 'לקיחת כדור',
                    desc: 'חשוב לפעול במדויק לפי ההמלצות ובמידה ואתם לא מצליחים לגרום לחתול לבלוע את הכדור נסו לדחוף לאוכל רטוב.'
                }
            ]
        },
    ],
    rabbit: [
        { // אוכל
            id: 'אוכל',
            title: 'הגיע שעת האוכל',
            desc: 'על פי סוג ומשקל הארנב.',
            times: [
                {
                    time: '10:00',
                    title: 'מילוי קערת האוכל',
                    desc: 'בזכות תזונה מסודרת יהנה הארנב מחיים ארוכים יותר ויגיע למימדים גדולים יותר.'
                }
            ]
        },
        { // ניקיון
            id: 'ניקיון',
            title: 'זמן ניקוי הכלוב',
            desc: 'התחזוקה היומית הנחוצה.',
            times: [
                {
                    time: '19:00',
                    title: 'ניקיו הכלוב',
                    desc: 'עליכם לנקות ולפנות שאריות מזון, להחליף את הנסורת שבכלוב ולהיפטר מגללים.'
                }
            ]
        },
        { // מים
            id: 'מים',
            title: 'מילוי המים בכלוב',
            desc: 'ניקוי ומילוי המים.',
            times: [
                {
                    time: '10:00',
                    title: 'מילוי מים',
                    desc: 'ארנבים צריכים לשתות הרבה ושותים הרבה. חשוב להקפיד שמים נקיים יהיו זמינים לשתייה כל היום.'
                }
            ]
        },
        { // חטיפים
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times: [
                {
                    time: '15:00',
                    title: 'חטיף יומי',
                    desc: 'לרוב יהיו עשויים מזרעים, פירות או דגנים אשר מכילים הרבה אנרגיה וקלוריות.'
                }
            ]
        }
    ],
    fish: [
        { // אוכל
            id: 'אוכל',
            title: 'הגיע שעת האוכל',
            desc: 'לפי סוג וגודל הדג',
            times: [
                {
                    time: '10:00',
                    title: 'ארוחה יומית',
                    desc: 'דגים הם יצורים בעלי רעב כמעט בלתי נגמר. האחריות שלכם היא לדאוג שלא יאכלו יותר מדי ומצד שני שלא ירעבו.'
                }
            ]
        },
        { // מים
            id: 'מים',
            title: 'כמות המים',
            desc: 'הקפדה על רענון המים.',
            times: [
                {
                    time: '18:00',
                    title: 'מים חדשים',
                    desc: 'רענון המים יעשה בין אחת לשבוע ועד אחת לחודש בנפח של בין 10% ל-30% ממי האקווריום.'
                }
            ]
        }
    ],
    bird: [
        { // מים
            id: 'מים',
            title: 'מילוי המים בכלוב',
            desc: 'ניקוי ומילוי המים.',
            times: [
                {
                    time: '10:00',
                    title: 'מילוי מים',
                    desc: 'כלי המים חייב להיות תמיד מלא. מומלץ לנקות בכל יום את הכלי ולרחוץ אותו עם חומר ניקוי עדין.'
                }
            ]
        },
        { // ניקיון
            id: 'ניקיון',
            title: 'זמן ניקוי הכלוב',
            desc: 'התחזוקה היומית הנחוצה.',
            times: [
                {
                    time: '19:00',
                    title: 'ניקיו הכלוב',
                    desc: 'כלובי תוכים חשובים במיוחד לניקיון כי ההפרשות שלהם יותר מהכל מושכים חיידקים, חרקים ומזיקים.'
                }
            ]
        },
        { // אוכל
            id: 'אוכל',
            title: 'הגיע שעת האוכל',
            desc: 'לדאוג תמיד שהכלי מלא.',
            times: [
                {
                    time: '11:00',
                    title: 'מילוי קערת האוכל',
                    desc: 'לדאוג תמיד שכלי האוכל יהיה מלא בכופתיות, לא מומלץ לתת לתוכי פינוקים לעיתים קרובות.'
                }
            ]
        },
        { // חטיפים
            id: 'חטיפים',
            title: 'אפשר לתת חטיף :)',
            desc: 'לפי הכמויות המומלצות.',
            times: [
                {
                    time: '15:00',
                    title: 'חטיף יומי',
                    desc: 'אפשרי לתת כל יום חתיכה של פרי או ירק אחר ולהוציא את השאריות למחרת.'
                }
            ]
        }
    ],
}

function getNotif(animalName){
    return NOTIF[animalName]
}

export const notifService = {
    getNotif
}