const tips = {
    dog: [ //dog
        { // Tip 1
            title: 'משמעות לסדר הרכיבים',
            desc: 'במזונות של כלבינו יש חשיבות לסדר הרכיבים. על פי חוק, רשימת הרכיבים צריכה להיות בסדר כמות מופחתת כך שהכמות הגדולה ביותר באוכל לכלב היא המרכיב הראשון הכמות הקטנה ביותר במזון היא המרכיב האחרון.'
        },
        { // Tip 2
            title: 'לא לנקות עם אקונומיקה',
            desc: 'במזונות של כלבינו יש חשיבות לסדר הרכיבים. על פי חוק, רשימת הרכיבים צריכה להיות בסדר כמות מופחתת כך שהכמות הגדולה ביותר באוכל לכלב היא המרכיב הראשון הכמות הקטנה ביותר במזון היא המרכיב האחרון.'
        },
        { // Tip 3
            title: 'כלב עייף שווה כלב שמח',
            desc: 'ישנם שלושה סוגים של פריקת אנרגיה: אנרגיה פיזית(הליכה/ריצה/משחק), מנטלית (כאשר הכלב חושב לדוגמא אילוף) ואורלית (בצורת לעיסה). העשרה עוזרת במניעת שעמום ויכולה לעזור בפתרון ובמניעת בעיות התנהגות של כלבים.'
        }
    ],
    cat: [
        { // Tip 1
            title: 'סוגר ביטחות',
            desc: 'ישנו מגוון רחב בעל סוגים שונים של קולרים לחתולים, הצבע והציורים הם לגמרי בחירה שלכם אך חשוב לשים לב שאחנו קונים קולר עם סוגר ביטחות. סוגר הבטיחות הוא קליפס שנפתח במידה ומרגיש לחץ. כלומר, במידה והחתול שלי נתקע או נתפס במשהו הקולר ישתחרר ולא יחנוק אותו.'
        },
        { // Tip 2
            title: 'שטיחון חול',
            desc: 'מומלץ להניח אותו בפתח ארגז החול. תפקידו "לתפוס" את גרגרי החול שנדבקו לכפותיו של החתול שנופלות ממנו כאשר הוא יוצא מהארגז וכך הם נאספים בשטיח ולא מתפזרים ברחבי הבית.'
        },
        { // Tip 3
            title: 'מזון חתולים וכלבים',
            desc: 'חלקינו נוטים לחשוב שאם קערת המזון של הכלב ושל החתול מתערבבת מדי פעם לא יקרה דבר. האמת היא שמזון כלבים שונה בהרכבו ממזון החתולים, וכל אחד מהם מכיל כמויות אחרות של חלבונים, שומנים ותוספי מזון. הקפידו להפריד - לאורך זמן זה עלול ליצור תזונה לקויה.'
        }
    ], //cat
    fish: [
        { // Tip 1
            title: 'מזון לא שוקע',
            desc: 'האכילו את הדגים רק פעם אחת ביום ובכמות המומלצת להם. במידה שאין בידיכם הוראות מתאימות – שימו לב כמה מזון הדגים מסוגלים לצרוך בתוך מספר דקות. אם מזון אינו נצרך מיד ושוקע אל תחתית האקווריום זה סימן להאכלת יתר.'
        },
        { // Tip 2
            title: 'דג יפה ובריא',
            desc: 'במידה והחלטתם לקנות דג חדש בקשו מבעל החנות להאכיל את הדג (רק מעט) ובכך נדע שהדג בריא והחנות טיפלה בו כראוי. דג בריא שוחה בצורה חופשית באקווריום ומגיב למזון בצורה די מהירה, סנפיריו מתוחים וצבעו חזק.'
        },
        { // Tip 3
            title: 'דגים ישנים בחושך',
            desc: 'אין להפעיל אור באקווריום לאורך כל היום, הדבר גורם להיווצרות אצות (מים ירוקים באקווריום). אם לא נכבה לעולם את האור באקווריום הדגים לא יוכלו לתפקד כרגיל ואף ימותו. הפעילו את האור במשך 6-8 שעות בלבד.'
        }
    ], //fish
    rabbit: [
        { // Tip 1
            title: 'נקי ומאוורר',
            desc: 'שתן של ארנבים מכיל ריכוז גבוה של שתנן ואמוניה ויכול לגרום להם לדלקות במערכת הנשימה ולגירוי בעיניים. לכן יש לשמור על כלוב מאוורר ואת המצע שמפזרים בתחתית הכלוב להחליף פעם בשבוע לפחות.'
        },
        { // Tip 2
            title: 'מים טריים וזמינים',
            desc: 'ארנבים רגישים לחום וליובש, לכן יש להקפיד שיהיה להם תמיד בקבוק עם פיה שתייה מלא במים (עדיף 2 בקבוקים) בתא הארנבים. כדאי ללחוץ מדי פעם על גולת הברזל בקצה פיית השתייה, כדי לוודא שהיא לא תקועה עקב אבנית.'
        },
        { // Tip 3
            title: 'מקום מסתור',
            desc: 'ארנב שלא יקבל מקום סגור להיות בו עלול לסבול מלחץ ודבר זה עלול להשפיע לרעה על בריאותו, מסיבה זו חשוב להוסיף לכלוב בית לארנב המאפשר לארנב להיכנס לתוכו לפי הצורך ומשמש עבורו מקום מוסתר ובטוח.'
        }
    ], //rabbit
    bird: [
        { // Tip 1
            title: 'חיות נוספות',
            desc: 'במידה ויש לכם בעלי חיים נוספים (חתולים כלבים בעיקר) הם יכולים לסכן את התוכים שלכם גם על ידי תקיפה פיזית וגם על ידי מחלות וטפילים שהתוכים יכול להדבק מהם. אם אכן יש לכם חיות נוספות בבית אתם חייבים לוודא שלא יהיה להם גישה ישירה אל התוכים.'
        },
        { // Tip 2
            title: 'ליטופים בגב',
            desc: 'תוכים לא אוהבים שמלטפים אותם בגב מכיוון שתוכי זו חיה נטרפת,  יש להם אינסטינקטים בסיסיים של הישמרות מפני טורפים, הם לא יהנו ממגע כזה בגלל שהם חשים מאויימים.'
        },
        { // Tip 3
            title: 'לא רואה אבל שומע',
            desc: 'למרות שהרבה אנשים מאמינים שלהכניס תוכי לכלוב ולכסות בבד ישלח אותו לישון בפועל התוכי משתתק מפחד, כי הוא לא יודע מה קורה סביבו, אבל שומע הכל. לכן הפתרון הוא לדאוג לחדר נפרד ושקט.'
        }
    ] //bird
}

function getReleventTips(animal) {
    return tips[animal]
}   

export const tipsService = {
    getReleventTips
}